SM_для_EDT/src/Documents/впЗакрытиеЗаявокИРемонтов/впЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗакрытиеЗаявокИРемонтов</name>
  <registerRecords>AccumulationRegister.впПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.впОтмененныеПеренесенныеРемонты</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакрываемыеЗаявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.впПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.впВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.впПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
        <types>DocumentRef.впВыявленныеДефекты</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеПричины</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/InformationRegisters/впОтмененныеПеренесенныеРемонты/впОтмененныеПеренесенныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впОтмененныеПеренесенныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>CatalogRef.впПричиныЗакрытияРемонтов</types>
    </type>
  </resources>
  <attributes>
    <name>УточнениеПричины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впЗакрытиеЗаявокИРемонтов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//rarus_AfoD 15.09.2021 < 
	ВыполняемПроведение = Ложь;
	ИспользоватьСтатусыЗаявокНаПереносРабот = рарусОбщегоНазначенияПовтИсп.ИспользоватьСтатусыЗаявокНаПереносРабот();
	Если ИспользоватьСтатусыЗаявокНаПереносРабот Тогда
		
		ВыполняемПроведение = Статус = Перечисления.СостоянияСогласования.Согласовано;
		
	Иначе
		
		ВыполняемПроведение = Согласовано;
		
	КонецЕсли; 
	
	Если НЕ ВыполняемПроведение Тогда
		
		Возврат;
		
	КонецЕсли; 
	//rarus_AfoD 15.09.2021 > 
	
	Для Каждого стрРем из  ЗакрываемыеРемонты Цикл
		стрДвиж = Движения.впОтмененныеПеренесенныеРемонты.Добавить();
		стрДвиж.ID 					= стрРем.ID;
		стрДвиж.ДатаНачала 			= стрРем.НоваяДатаНачала;
		стрДвиж.ДатаОкончания 		= стрРем.НоваяДатаОкончания;
		стрДвиж.Отменен 			= стрРем.Отменен;
		стрДвиж.Период 				= МоментВремени().Дата;
		стрДвиж.Причина 			= стрРем.ПричинаЗакрытия;
		стрДвиж.УточнениеПричины 	= стрРем.УточнениеПричины;

		
		//RARUS-NN EvgenU РАIT-0023372 2021_06_07 ++
		Если ТипЗнч(стрРем.ДокументОснование) = Тип("ДокументСсылка.впЗаявкаНаРемонт") Тогда
			ДокОбъект = стрРем.ДокументОснование.ПолучитьОбъект();
			СтруктураПоиска = Новый Структура("ID", стрРем.ID);
			НайдСтроки = ДокОбъект.РемонтыОборудования.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТЧ Из НайдСтроки Цикл
				СтрокаТЧ.ДатаНачала = стрРем.НоваяДатаНачала;
				СтрокаТЧ.ДатаОкончания = стрРем.НоваяДатаОкончания;
			КонецЦикла;
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		ИначеЕсли ТипЗнч(стрРем.ДокументОснование) = Тип("ДокументСсылка.впВыявленныеДефекты") Тогда
			ДокОбъект = стрРем.ДокументОснование.ПолучитьОбъект();
			СтруктураПоиска = Новый Структура("ID", стрРем.ID);
			НайдСтроки = ДокОбъект.СписокДефектов.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТЧ Из НайдСтроки Цикл
				СтрокаТЧ.ДатаНачалаРемонта = стрРем.НоваяДатаНачала;
				СтрокаТЧ.ДатаОкончанияРемонта = стрРем.НоваяДатаОкончания;
			КонецЦикла;
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		//RARUS-NN EvgenU РАIT-0023372 2021_06_07 --
	КонецЦикла;
	Движения.впОтмененныеПеренесенныеРемонты.Записывать = Истина;
	
КонецПроцедуры

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		СписокЗакрываемыеРемонты = Неопределено;
		Если ДанныеЗаполнения.СВойство("ЗакрываемыеРемонты", СписокЗакрываемыеРемонты) Тогда
			Для Каждого ЭлементЗакрываемыеРемонты Из СписокЗакрываемыеРемонты Цикл
				нСтрока = ЗакрываемыеРемонты.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрока, ЭлементЗакрываемыеРемонты.Значение);
			КонецЦикла;
		КонецЕсли;
		пСогласовано = Ложь;
		Если ДанныеЗаполнения.СВойство("Согласовано", пСогласовано) Тогда
			Согласовано = пСогласовано;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделение)
		И ЗакрываемыеРемонты.Количество() Тогда
		//взять судно из первого объекта ремонта
		Если  ЗначениеЗаполнено(ЗакрываемыеРемонты[0].ОбъектРемонта) Тогда
			Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗакрываемыеРемонты[0].ОбъектРемонта, "ПодразделениеИсполнитель");
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		//установить единственную организацию
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Организация = Выборка.Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --


Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.СостоянияСогласования.Рассматривается;
	УточнениеСтатуса = "";
КонецПроцедуры
